{
    "PageTitle": "Kitchen Management",
    "Subtitle": "A good cook keeps a good kitchen. This means efficient shopping, and knowing what you have (and should have) in your storecupboard and fridge.",
    "MainImage": "",
    "Content": [
      {
        "Image":  "https://firebasestorage.googleapis.com/v0/b/recipes-app-b0961.appspot.com/o/shopping.jpg?alt=media&token=727c6d09-9a3e-489b-9e26-1284e71cf919",
        "Title": "Shopping",
        "Text": "Like most other aspects of preparing food, shopping is not difficult - infact, many of us do it fairly successfully every day. However, there is a such a thing as efficient shopping, and much of it relies on commonsense. \n\nCheck what needs topping up in your storecupboard and put those into your trolley first. Avoid cans that have dents in them. Meats, dairy products and other refridgerated items should be kept well chilled, so choose them last, just before you head to the checkout. A handy tip is to choose items which are stored towards the back of the refridgerator cabinet or underneath the top layer (these are sometimes close to lights and not cold enough). Don't choose refridgerator items which have swollen packaging. Vacuum packaging should not be loose. Read use-by dates (this applies to everything, not just refridgerated goods) and buy products as far from the date as possible (you might find these have been stacked at the back of the cabinet). \n\nFrozen food should be obviously frozen, with no large ice crystals and without the food being frozen into clumps (this shows that the food has partially thawed and been refrozen). In hot weather, carry an insulated container in the car to transport shopping home."
      },
      {
        "Image":  "https://firebasestorage.googleapis.com/v0/b/recipes-app-b0961.appspot.com/o/cupboard.jpg?alt=media&token=7e219b9d-0b77-4a56-b144-24cb584eb4e4",
        "Title": "Your Storecupboard",
        "Text": "Although it is best to shop regularly for meat, seafood and seasonal vegetables, there are certain products that you will want to keep permanently in your storecupboard, to provide the backbone of your daily cooking. As a general rile, you should try to have in you're pantry: \n\nBaking powder \nBeans, canned and dried \nBreadcrumbs, dry \nCapers \nCocoa powder \nCoconut milk \nCornflour \nCouscous \nDried fruits, such as raisins, currants, apricots \nFlour (plain and self-raising) \nGelatine \nHoney \nMustards \nNoodles \nNuts \nOils (olive, sesame, vegetable) \nOlives \nPasta \nPolenta \nRice, long-grain, short-grain and arborio \nSoy sauce \nStocks \nSugars \nTabasco \nTomatoes, canned \nTomato paste \nVinegars, white wine, red wine, brown and balsamic \nWorcestershire sauce \nYeast \n\nThese are best stored in a cool, dark dry pantry. Most will keep for at least 3, if not 6, months. \n\nIt is best to buy whole spices and grind them yourself, as needed - they stay fresher than the jars. Make sure bottles of oil are kept out of direct light, as they can become rancid, however, if you keep them in the fridge the oil will thicken and appear cloudy - it will return to normal once it has reached room temperature again. Most bottles of sauces and condiments should be refridgerated once opened: check the label. \n\nKeep potatoes and onions in a cool, dark place - though not without adequate ventilation. Tomatoes, like most fruit, are best kept at room temperature, unless the weather is very hot or they are very ripe."
      },
      {
        "Image":  "https://firebasestorage.googleapis.com/v0/b/recipes-app-b0961.appspot.com/o/fridge.jpg?alt=media&token=84ffdb22-6438-4cd4-a68f-0344662aca2d",
        "Title": "Your fridge",
        "Text": "Your fridge is somewhere where important hygiene rules come into play. When you get home with your shopping, unwrap meat or chicken and place on a plate large enough to prevent drips falling on to other food. Cover losely with foil or plastic wrap. \n\nBacteria in food is killed by cooking, but take care not to put cooked food back into the fridge touching raw food, which could contaminate it. For example, never let raw meat drip onto cooked dishes. The same goes for when you are preparing food: if you chop raw meat, don't then use the same, unwashed chopping board and knife to prepare salad, or slice cooked meat. \n\nStore vegetables unwashed (unless they are dried thoroughly, the moisture contributes to deterioration) in the crisper compartment of the fridge. \n\nMany recipes will instruct you to cook something, then 'cool and refridgerate'. When you are doing this, cool the food as quickly as possible before refridgerating. Transfer it from the cooking pan to a wide bowl and stir frequently to release the heat. It is not necessary for the food to be completely cold before it is refridgerated, just cooled. Don't put hot food in the fridge or freezer or it will raise the temperature inside, putting other foods at risk of deterioration. \n\nThe remaining contents of half-used cans should be transferred to a bowl or plastic container and refrigerated. Use within 2-3 days or discard. \n\nThaw frozen food in the fridge, not at room temperature and never in a sink full of water. If you haven't removed food from the freezer in enough time, thaw in the microwave, or have something else. \n\nNever refreeze thawed food. (Of course, you can thaw something, cook it and then freeze again - for instance forzen chicken that you might casserole and then freeze.) \n\nClean out your fridge, freezer and storecupboard regularly and remember - if you ever have any doubts about the freshness of a product, throw it out."
      }
    ]
}