{
  "PageTitle": "Recipes",
  "Subtitle": "Here are some recipes to try out some of the tips you've learnt from this app.",
  "MainImage": "",
  "Content": {
    "GamePie": {
      "Image": "https://firebasestorage.googleapis.com/v0/b/recipes-app-b0961.appspot.com/o/game-pie.jpg?alt=media&token=18e20cfd-db30-44c0-8903-375f8bdf0402",
      "Title": "Game Pie",
      "Text": "This traditional raised pie makes an impressive centrepiece for a summer buffet and keeps well for days in the fridge.",
      "Serves": "Serves 8",
      "PrepTime": "Prep: 30 min",
      "CookingTime": "Cooking: 1:30 hours",
      "Ingredients": "Ingredients \n\nFor the hot water pastry \n\n• 400g (14oz) plain flour, plus extra for dusting \n•½ tsp fine salt \n•150g (5 ½ oz) lard or beef dripping, cubbed \n•1 egg, beaten, for glazing \n\nFor the filling \n•150g (5 ½ oz) pork shoulder, cut in 1cm chunks \n•150g (5 ½ oz) pork belly, trimmed, cut in 1cm chunks \n•250g (9oz) venison, cut in 1cm chunks \n•2 pheasant breasts, cut in 1cm slices \n•Sea salt and freshly ground black pepper \n\nFor the jelly \n•4 sheets of leaf gelatine, cut into pieces \n•350ml chicken stock",
      "Method": "Method \n\n1 - Preheat the oven to 200 degrees C (400 degrees F/ Gas 6). To make the hot water crust, place the flour and salt in a bowl and make a well. Boil a kettle, then measure out 150ml boiling water into a jug. Add the lard or dripping to the water, and stir until the fat has melted. This reduces the temperature of the water and makes it easier to work with. \n\n2 - Pour the liquid into the centre of the flour and mix together with a wooden spoon. At the end, you will need to use your hands to bring it all together into a soft dough. Be careful, as it will be hot. Cut off one-quarter of the pastry, wrap it in a clean tea towel and put it somewhere warm for later. \n\n3 - Working quickly, as the pastry will harden as it cools, turn the dough out on a well-floured work surface and roll it out to a thickness of 5mm. Use the rolling pin to carefully lift the pastry into the loaf tin. Press it firmly all around the bottom and the sides of the tin. Trim off any excess pastry, allowing an overhang of 2cm. \n\n4 - pack the pastry case with layers of the pork, venison, and pheasant, seasoning liberally between each layer. Brush the edges of the pastry with a little beaten egg. Now roll out the set-aside pastry and use it to top the pie. Press down firmly all around the edges of the tin with your fingers to seal, and trim off any excess. Decorate the pie, if desired, with pastry leaves made from the off-cuts, and brush the top with a little beaten egg. Use a chopstick or other implement to make a hole in the top of the pie, so you can fill with jelly after it has cooked. \n\n5 - Bake the pie in the centre of the oven for 30 minutes, then reduce the heat to 160 degrees C and cook for a further 1 ¼ hours until golden brown. Remove the pie from the oven and leave it to cool in the tin. \n\n6 - Soak the gelatine in a little cold water for 5 minutes until softened. Heat the chicken stock and add the softened gelatine, stirring constantly until it dissolves. Leave it to cool. Once the liquid starts to thicken, but not solidify, pour it using a small funnel into the top of the pie , a little at a time, You may need to re-open the hole in the top of the pie if it has closed up while cooking. Refrigerate to set the jelly overnight before eating."
    },
    "WhiteLoaf": {
      "Image": "https://firebasestorage.googleapis.com/v0/b/recipes-app-b0961.appspot.com/o/white-loaf.jpg?alt=media&token=3094148a-7ad7-4e3f-9a60-332ec2f4dd16",
      "Title": "White Loaf",
      "Text": "Mastering a classic white loaf should be a rite of passage for all amateur bakers. Nothing beats the taste of fresh, crusty white bread, still warm from the oven.",
      "Serves": "Makes 1 Loaf",
      "PrepTime": "Prep: 20 mins",
      "CookingTime": "Cooking: 40-45 mins - Rising and proving: 2-3 hours",
      "Ingredients": "Ingredients \n\n•500g very strong white bread flour, plus extra for dusting \n•1 tsp fine salt \n•2tsp dried yeast \n•1tbsp sunflower oil, plus extra for greasing",
      "Method": "Method \n\n1 - Put the flour and salt in a bowl. In a small bowl, dissolve the dried yeast in 300ml warm water. Once it has dissolved, add the oil. Make a well in the centre of the flour. Pour in the liquid, stirring to form a rough dough. Use your hands to bring the dough together. \n\n2 - Turn the dough out onto a lightly floured work surface. Knead for 10 minutes until smooth, glossy, and elastic. Put the dough in a lightly oiled bowl, cover loosely with cling film and leave to rise in a warm place for up to 2 hours, until doubled in size. \n\n3 - When the dough has risen, turn it out onto a floured surface and knock it back to its original size. Knead it and shape it into desired shape; such as a long, curved oblong shape known as a bloomer. Place the dough on a baking tray, cover it with cling film and a clean tea towel, and leave it in a warm place until well risen and doubled. This could take 30 minutes-1 hour. The bread is ready to bake when it is tight and well risen, and a finger poked into the dough leaves a dent which springs back quickly. \n\n4 - Preheat the oven to 200 degrees. Place one oven shelf in the middle of the oven, and one below it, close to the bottom of the oven. Boil a kettle. Now slash the top of the loaf 2 or 3 times with a knife on the diagonal. This will allow the bread to continue to rise in the oven. Dust the top with flour and place it on the middle shelf. Place a roasting pan on the bottom shelf of the oven and then quickly pour the boiling water into it and shut the door. This will allow steam to be created in the oven and help the bread to rise. \n\n5 - Bake the bread for 10 minutes, then reduce to 190 degrees C and bake it for 30-35 minutes until the crust is golden brown and the bottom sounds hollow when tapped. Reduce to 180 degrees C if it is starting to brown too quickly. Remove the bread from the oven and leave to cool on a wire rack."
    },
    "VictoriaSpongeCake": {
      "Image": "https://firebasestorage.googleapis.com/v0/b/recipes-app-b0961.appspot.com/o/victoria-sponge.jpg?alt=media&token=df98f4e2-ac9a-4c10-a363-0bd9d5bae853",
      "Title": "Victoria Sponge Cake",
      "Text": "Probably the most iconic British cake, a good Victoria sponge should be well-risen, moist, and as light as air.",
      "Serves": "Serves 6-8",
      "PrepTime": "Prep: 30 mins",
      "CookingTime": "Cooking: 20-25 mins",
      "Ingredients": "Ingredients \n\n•175g unsalted butter, softened, plus extra for greasing \n•175g caster sugar \n•3 eggs \n•1tsp vanilla extract \n•175g self-raising flour \n•1tsp baking powder \n\nFor the filling \n•50g unsalted butter, softened \n•100g icing sugar, plus extra to serve \n•1tsp vanilla extract \n•115g good quality seedless raspberry jam",
      "Method": "Method \n\n1 - Preheat oven to 180 degrees C. Grease the tins and line with parchment \n\n2 - Whisk the butter and sugar in a bowl for 2 minutes, or until pale, light, and fluffy \n\n3 - Add the eggs one at a time, mixing well between additions to avoid curdling \n4 Add the vanilla extract and whisk briefly until it is well-blended through the batter \n\n5 - Whisk the mixture for another 2 minutes until bubbles appear on the surface \n\n6 - Remove the whisk, then sift the flour and baking powder into the bowl \n7 With a metal spoon, gently fold in the flour until just smooth; try to keep the mixture light \n\n8 - Divide the mixture evenly between the tins and smooth the tops with a palette knife \n\n9 - Cook for 20-25 minutes or until golden brown and springy to the touch \n\n10 - Test the sponges by inserting a skewer. If it comes out clean, the cakes are cooked \n\n11 - Leave for a few minutes in the tins. Turn out, good side up, onto a wire rack to cool \n\n12 - For the filling, beat together the butter, icing sugar, and vanilla extract until smooth \n\n13 - Spread the buttercream evenly onto the flat side of a cooled sponge with a palette knife \n\n14 - Gently spread the jam on top of the buttercream using a table knife \n\n15 - Top with the second sponge, flat sides together. Serve dusted with sifted icing sugar"
    }
  }

}